docs/site/20260129205743-bassoon_humdrum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bassoon Humdrum</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bassoon Humdrum</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgde3d125">Project Specs</a></li>
<li><a href="#org5a4cc17">Manual Encoding Cheat Sheet (**kern)</a></li>
<li><a href="#org204252f">The Encoding Production Line (Fastest Route)</a>
<ul>
<li><a href="#orgbc3b4bb"><b>PDF Source</b>: Clean scan</a>
<ul>
<li><a href="#orgd3b928f">Script</a></li>
<li><a href="#org80edc11">Adjusting parameters</a></li>
<li><a href="#org5094748">Threshold Script</a></li>
<li><a href="#org9f9f75d">Combine the tifs</a></li>
</ul>
</li>
<li><a href="#orgd22001e">OMR (Audiveris): Run OMR.</a>
<ul>
<li><a href="#org2c745da">Initial Processing</a></li>
<li><a href="#org06b8a3b">Edit</a></li>
<li><a href="#org65e1d8d">Run the link and score steps</a></li>
<li><a href="#org19b4f29">Export to musicxml</a></li>
</ul>
</li>
<li><a href="#org7e0c8b8">Cleanup (MuseScore): Import XML from Audiveris.</a></li>
<li><a href="#org9d46b92">Conversion: `xml2hum filename.musicxml &gt; filename.krn`</a></li>
<li><a href="#org50cce1f">Validation:</a></li>
</ul>
</li>
<li><a href="#org4e7048f">Musescore</a></li>
<li><a href="#orgddf3779">Next Session Breadcrumbs</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgde3d125" class="outline-2">
<h2 id="orgde3d125">Project Specs</h2>
<div class="outline-text-2" id="text-orgde3d125">
<ul class="org-ul">
<li>Root: `~/bassoonhumdrum/classicalConcerti`</li>
<li>Current Work: `~/bassoonhumdrum/classicalConcerti/mozart_k191/`</li>
<li>Format: `**kern` (Target)</li>
</ul>
</div>
</div>
<div id="outline-container-org5a4cc17" class="outline-2">
<h2 id="org5a4cc17">Manual Encoding Cheat Sheet (**kern)</h2>
<div class="outline-text-2" id="text-org5a4cc17">
<ul class="org-ul">
<li><b><b>Durations</b></b>: 4 = Quarter, 8 = Eighth, 16 = Sixteenth, 2 = Half.</li>
<li><b><b>Pitches</b></b>: 
<ul class="org-ul">
<li>Middle C = `c`</li>
<li>C above = `cc`</li>
<li>C below = `C`</li>
<li>Flats = `-` (e.g., `e-` for Eb)</li>
<li>Sharps = `#` (e.g., `f#` for F#)</li>
</ul></li>
<li><b><b>Barlines</b></b>: `=1`, `=2`, etc.</li>
<li><b><b>Slurs</b></b>: `(` and `)`</li>
<li><b>More</b>: <a href="https://doc.verovio.humdrum.org/humdrum/getting_started/">Verovio quickstart</a></li>
</ul>
</div>
</div>
<div id="outline-container-org204252f" class="outline-2">
<h2 id="org204252f">The Encoding Production Line (Fastest Route)</h2>
<div class="outline-text-2" id="text-org204252f">
</div>
<div id="outline-container-orgbc3b4bb" class="outline-3">
<h3 id="orgbc3b4bb"><b>PDF Source</b>: Clean scan</h3>
<div class="outline-text-3" id="text-orgbc3b4bb">
</div>
<div id="outline-container-orgd3b928f" class="outline-4">
<h4 id="orgd3b928f">Script</h4>
<div class="outline-text-4" id="text-orgd3b928f">
<div class="org-src-container">
<pre class="src src-bash">magick -density 300 <span style="color: #7FC1CA;">"mozartscore.pdf"</span> <span style="color: #7FC1CA;">\</span>
       -deskew 40% <span style="color: #7FC1CA;">\</span>
       -gaussian-blur 0.05 <span style="color: #7FC1CA;">\</span>
       -unsharp 0x1 <span style="color: #7FC1CA;">\</span>
       -threshold 50% <span style="color: #7FC1CA;">\</span>
       -type Bilevel <span style="color: #7FC1CA;">\</span>
       -compress none <span style="color: #7FC1CA;">\</span>
       -depth 8 <span style="color: #7FC1CA;">\</span>
       <span style="color: #7FC1CA;">"page_%03d.tif"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org80edc11" class="outline-4">
<h4 id="org80edc11">Adjusting parameters</h4>
<div class="outline-text-4" id="text-org80edc11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">If you see&#x2026;</th>
<th scope="col" class="org-left">The Problem</th>
<th scope="col" class="org-left">The Tweak</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Faint/Broken Lines</td>
<td class="org-left">The image is too "light"</td>
<td class="org-left">Lower the -threshold. Try 40%.</td>
</tr>

<tr>
<td class="org-left">Bleeding/Bloated Notes</td>
<td class="org-left">The ink is "bleeding" together</td>
<td class="org-left">Higher the -threshold. Try 60%.</td>
</tr>

<tr>
<td class="org-left">Grainy "Sand" in the White Space</td>
<td class="org-left">High-frequency noise</td>
<td class="org-left">Increase -gaussian-blur. Try 1.5 or 2.0.</td>
</tr>

<tr>
<td class="org-left">Note heads looking like "blobs"</td>
<td class="org-left">Too much blur</td>
<td class="org-left">Increase the -unsharp value (e.g., -unsharp 0x2).</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5094748" class="outline-4">
<h4 id="org5094748">Threshold Script</h4>
<div class="outline-text-4" id="text-org5094748">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #899BA6;">#</span><span style="color: #899BA6;">!/bin/</span><span style="color: #9A93E1;">bash</span><span style="color: #899BA6;">
</span><span style="color: #899BA6;"># </span><span style="color: #899BA6;">test_omr.sh &lt;pdf_file&gt; &lt;page_number&gt;
</span>
<span style="color: #DF8C8C;">PAGE</span>=$(<span style="color: #A8CE93; font-weight: bold;">( $2 - 1 </span>)) <span style="color: #899BA6;"># </span><span style="color: #899BA6;">ImageMagick uses 0-based indexing
</span>
<span style="color: #9A93E1;">for</span> THRESH<span style="color: #9A93E1;"> in</span> 35 45 50 55 65
<span style="color: #9A93E1;">do</span>
    <span style="color: #83AFE5;">echo</span> <span style="color: #7FC1CA;">"Generating test with ${THRESH}% threshold..."</span>
    magick -density 300 <span style="color: #7FC1CA;">"$1[$PAGE]"</span> <span style="color: #7FC1CA;">\</span>
        -deskew 40% <span style="color: #7FC1CA;">\</span>
        -gaussian-blur 0.05 <span style="color: #7FC1CA;">\</span>
        -unsharp 0x1 <span style="color: #7FC1CA;">\</span>
        -threshold ${<span style="color: #DF8C8C;">THRESH</span>}% <span style="color: #7FC1CA;">\</span>
        -type Bilevel <span style="color: #7FC1CA;">\</span>
        <span style="color: #7FC1CA;">"test_th_${THRESH}.tif"</span>
<span style="color: #9A93E1;">done</span>

<span style="color: #83AFE5;">echo</span> <span style="color: #7FC1CA;">"Done. Open these files to compare clef and staff clarity."</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f9f75d" class="outline-4">
<h4 id="org9f9f75d">Combine the tifs</h4>
<div class="outline-text-4" id="text-org9f9f75d">
<div class="org-src-container">
<pre class="src src-bash">tiffcp page01.tif page02.tif page03.tif output.tiff
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd22001e" class="outline-3">
<h3 id="orgd22001e">OMR (Audiveris): Run OMR.</h3>
<div class="outline-text-3" id="text-orgd22001e">
</div>
<div id="outline-container-org2c745da" class="outline-4">
<h4 id="org2c745da">Initial Processing</h4>
<div class="outline-text-4" id="text-org2c745da">
<div class="org-src-container">
<pre class="src src-bash">audiveris -batch -step SYMBOLS -save -option org.audiveris.omr.text.Language.defaultSpecification=eng+ita -output ./omr_output/ ./page_*.tif
</pre>
</div>
</div>
</div>
<div id="outline-container-org06b8a3b" class="outline-4">
<h4 id="org06b8a3b">Edit</h4>
<div class="outline-text-4" id="text-org06b8a3b">
<ul class="org-ul">
<li><b>Tip</b>: Don't aim for perfection in Audiveris. Just get the pitches and rhythms mostly right.</li>
<li>Check clef changes, accidentals, key signatures, brackets for layout.</li>
</ul>
</div>
</div>
<div id="outline-container-org65e1d8d" class="outline-4">
<h4 id="org65e1d8d">Run the link and score steps</h4>
<div class="outline-text-4" id="text-org65e1d8d">
<p>
Check the red measures, but not too much
</p>
</div>
</div>
<div id="outline-container-org19b4f29" class="outline-4">
<h4 id="org19b4f29">Export to musicxml</h4>
</div>
</div>
<div id="outline-container-org7e0c8b8" class="outline-3">
<h3 id="org7e0c8b8">Cleanup (MuseScore): Import XML from Audiveris.</h3>
<div class="outline-text-3" id="text-org7e0c8b8">
<ul class="org-ul">
<li><b>Priority</b>: Correct the "measure math" (ensure barlines add up). Humdrum will crash if the durations in a measure are wrong.</li>
</ul>
</div>
</div>
<div id="outline-container-org9d46b92" class="outline-3">
<h3 id="org9d46b92">Conversion: `xml2hum filename.musicxml &gt; filename.krn`</h3>
</div>
<div id="outline-container-org50cce1f" class="outline-3">
<h3 id="org50cce1f">Validation:</h3>
<div class="outline-text-3" id="text-org50cce1f">
<p>
Run humdrum for syntax and proof for rhythm on the file
</p>
</div>
</div>
</div>
<div id="outline-container-org4e7048f" class="outline-2">
<h2 id="org4e7048f">Musescore</h2>
<div class="outline-text-2" id="text-org4e7048f">
<ul class="org-ul">
<li>Combined parts need to be exploded to create their own spines</li>
<li>Dynamics don't transfer, so don't worry about them</li>
</ul>
</div>
</div>
<div id="outline-container-orgddf3779" class="outline-2">
<h2 id="orgddf3779">Next Session Breadcrumbs</h2>
<div class="outline-text-2" id="text-orgddf3779">
<ul class="org-ul">
<li>Breadcrumb: Movement 1 is done, movement 2 is in musescore proofing. Movement 3 is ready for proofing.</li>
<li><b>Current Task</b>: Edit movement 2 in musescore. probably at listening stage</li>
<li>Next Step: Clean movement 2 in musescore</li>
<li><b>Next Step</b>: Check if kern.el can help speed up encoding</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
